app/controllers/constituencies_controller.rb

  def index
    @constituencies = Constituency.all
---
SELECT "constituencies".* FROM "constituencies"

  def show
    @constituency = Constituency.find(params[:id])
---
SELECT "constituencies".* FROM "constituencies" WHERE ("constituencies"."id" = 1) LIMIT 1

  def create
    @constituency = Constituency.new(params[:constituency])
    if @constituency.save
---
INSERT INTO "constituencies" ("number", "created_at", "updated_at") VALUES (110, '2011-01-28 14:13:29.145349', '2011-01-28 14:13:29.145349')

  def destroy
    @constituency = Constituency.find(params[:id])
    @constituency.destroy
---
SELECT "constituencies".* FROM "constituencies" WHERE ("constituencies"."id" = 6) LIMIT 1
DELETE FROM "constituencies" WHERE ("constituencies"."id" = 6)